# Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растёт на круглой грядке, причём кусты высажены только по окружности. Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растёт N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло различное число ягод — на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники. Эта система состоит из управляющего модуля и нескольких собирающих модулей. Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом, собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может собрать за один заход собирающий модуль, находясь перед некоторым кустом заданной во входном файле грядки.

import random

count = int(input("Введите количество кустов: "))
count_fruit = list()
for i in range(count):
    count_current = random.randint(0,100)
    count_fruit.append(count_current)
list_count = list()
for i in range(count-1):
    list_count.append(count_fruit[i-1]+count_fruit[i]+count_fruit[i+1])
list_count.append(count_fruit[-2]+count_fruit[-1]+count_fruit[0])
print(max(list_count))